# Length

## Description
_Vectorworks 2012 Deprecated Functions_. See LengthN for a replacement.

Returns the length of an object. If more than one object matches the search criteria, the function will return the sum of all the matching object lengths.

```pascal
FUNCTION Length(c : CRITERIA): REAL;
```

```python
def vs.Length(c):
    return REAL
```

## Parameters
|Name|Type|Description|
|---|---|---|
|c|CRITERIA|Search criteria.|

## Examples
#### VectorScript ####
```pascal
LengthValue:=Length(C='CrossMembers');
{returns the length of all objects in class 'CrossMembers'}
```
#### Python ####
```python

```

```pascal
resultVal := Length(c);
```
```python
result = vs.Length(c)
```

## Version
Availability: from All Versions
Deprecated: Vectorworks 2012 Deprecated Functions

## Category
* Criteria